[
  {
    "proposalId": "gov_action1n5sn54mgf47a7men2ryq6ppx88kta4wvenz2qkl4f9v6ppje8easqxwm88m",
    "proposalTxHash": "9d213a57684d7ddf6f3350c80d042639ecbed5ccccc4a05bf54959a086593e7b00",
    "proposalIndex": 0,
    "voteTxHash": "8bce47f5ba5fe40f7c85c50a3806c3fb1d53f53b45e5940a61fd7a937e48a5a2",
    "blockTime": "2025-07-23T12:59:55.000Z",
    "vote": "No",
    "metaUrl": null,
    "metaHash": null,
    "proposalTitle": "Cardano GovTool Budget - 12 months full active maintenance and development",
    "proposalType": "InfoAction",
    "proposedEpoch": 567,
    "expirationEpoch": 574,
    "rationale": "No rationale available"
  },
  {
    "proposalId": "gov_action1vrkk4dpuss8l3z9g4uc2rmf8ks0f7j534zvz9v4k85dlc54wa3zsqq68rx0",
    "proposalTxHash": "60ed6ab43c840ff888a8af30a1ed27b41e9f4a91a89822b2b63d1bfc52aeec4500",
    "proposalIndex": 0,
    "voteTxHash": "ae6409b74d9c36a414bd127ce72a5bb5c74ffdcd58b643a328600baace2a60a1",
    "blockTime": "2025-07-10T08:47:01.000Z",
    "vote": "Yes",
    "metaUrl": null,
    "metaHash": null,
    "proposalTitle": "Amaru Treasury Withdrawal 2025",
    "proposalType": "TreasuryWithdrawals",
    "proposedEpoch": 566,
    "expirationEpoch": 573,
    "rationale": "Title: Amaru Treasury Withdrawal 2025\nType: Treasury Withdrawal\n\nMembers of the Mesh DRep have voted as following on the governace action Amaru Treasury Withdrawal 2025\n\nYes: 4 votes \nNo: 0 votes \nAbstain: 0 votes  \n\nTherefore, we YES on the Amaru Treasury Withdrawal 2025.\n\nOur rationale \nWe mainly apply and extend our rationale to the previous Amaru info action which has been approved since then and enabled this follow up Treasury Withdrawal proposal. \n\n- modest budget request.\nAmaru requests a total of 1.5M Ada, which is a reasonable amount for the outlined work, furthermore, we appreciate the well outlined budget allocations of the proposal. However, it is important to keep in mind that the 1.5M Ada requested from Amaru are not the full budget which will be required to fully build and implement the Node, further funding requests will surely come. Therefore, it would be great to get a at least rough estimation of the total budget required ahead and beyond the initial 1.5M Ada.\n\n- feasible deliverables\nThe proposal is well scoped, the envisioned deliverables are very likely to be achieved, one of the most solid proposal we have seen so far indeed and a great first treasury withdrawal gov action.\n\n- Ecosystem value\nAmaru, supporting cardano node diversity definitely adds great value to the cardano ecosystem and we fully support serious projects working on that front. The\n\n- All-star Team\nWe have no doubt on the team, sort of a finest all-star crew at Amaru with all the needed skills, expertise and experience to successfully execute and complete the proposal\n\nWe see the Amaru treasury-withdrawal proposal similar to their initial info-action as really well written proposals which introduces a gold standard and a high quality for governance actions from which we hope that other proposers will draw from. Furthermore, we see Pragma as a highly competent organisation which does not only manages its operations in a highly desirable way but also ensures that projects like Amaru have a highest likelyhood in a cost-effective development and further maintenance. \n\n\nIf you approve of our reasoning and want to further support us, we welcome you to delegate to our Mesh DRep\nMore about our DRep at: https://gov.meshjs.dev/drep-voting"
  },
  {
    "proposalId": "gov_action1vdlrcftd48qn2zz8egepr6xyfcmxpfz8r69k769gc5mhg662adesq9yy8pl",
    "proposalTxHash": "637e3c256da9c1350847ca3211e8c44e3660a4471e8b6f68a8c537746b4aeb7300",
    "proposalIndex": 0,
    "voteTxHash": "3413a2fb941005dd7bf9f682f36a2b3c64a6c8f8d2e8040a993855eeccbc4d12",
    "blockTime": "2025-06-07T09:56:34.000Z",
    "vote": "Abstain",
    "metaUrl": null,
    "metaHash": null,
    "proposalTitle": "Set a 300 million ADA Net Change Limit for Epochs 563–635",
    "proposalType": "InfoAction",
    "proposedEpoch": 556,
    "expirationEpoch": 563,
    "rationale": "Members of the Mesh DRep have voted as following on the governace action: Set a 300 million ADA Net Change Limit for Epochs 563–635: \n\nYes: 0 votes \nNo: 2 votes \nAbstain: 3 votes\n\nTherefore, we will vote Abstain on the proposal in its current form.\n\nRationale:\n\nWe already voted Yes on the NCL = 200M Ada proposal and vote abstain on the NCL 300M Ada."
  },
  {
    "proposalId": "gov_action1h4ygjv0hjfj3lmafcm76rpdzcm8vsvj9k5wejn3npyxwxm3fesnqqw9kxxz",
    "proposalTxHash": "bd488931f792651fefa9c6fda185a2c6cec83245b51d994e33090ce36e29cc2600",
    "proposalIndex": 0,
    "voteTxHash": "5394deadeda08098a34dd08dc438a027972ed46018373fb1adc20f85ca520748",
    "blockTime": "2025-06-06T09:05:14.000Z",
    "vote": "Yes",
    "metaUrl": null,
    "metaHash": null,
    "proposalTitle": "Cardano Blockchain Ecosystem Budget: Amaru Node Development 2025",
    "proposalType": "InfoAction",
    "proposedEpoch": 556,
    "expirationEpoch": 563,
    "rationale": "Members of the Mesh DRep have voted as following on the governace action: Cardano Blockchain Ecosystem Budget: Amaru Node Development 2025: \n\nYes: 7 votes \nNo: 0 votes \nAbstain: 0 votes  \n\nTherefore, we support the Amaru proposal.\n\nRationale:\n- modest budget request.\nAmaru requests a total of 1.5M Ada, which is a reasonable amount for the outlined work, furthermore, we appreciate the well outlined budget allocations of the proposal\n\n- feasible deliverables\nThe proposal is well scoped, the envisioned deliverables are very likely to be achieved, one of the most solid proposal we have seen so far indeed.\n\n- Ecosystem value\nAmaru, supporting cardano node diversity definitely adds great value to the cardano ecosystem and we fully support serious projects working on that front\n\n- All-star Team\nWe have no doubt on the team, sort of a finest all-star crew at Amaru with all the needed skills, expertise and experience to successfully execute and complete the proposal\n\nWe see the Amaru proposal as a really well written proposal which introduces a gold standard and a high quality for governance actions from which we hope that other proposers will draw from. Furthermore, we see Pragma as a highly competent organisation which does not only manages its operations in a highly desirable way but also ensures that its projects like Amaru have a highest likelyhood in a cost-effective development and further maintenance. \n\nIf you approve of our reasoning and want to further support us, we welcome you to delegate to our Mesh DRep\nMore about our DRep at: https://gov.meshjs.dev/drep-voting"
  },
  {
    "proposalId": "gov_action1mmalzkcxpyn33t05hml2hxpwq0ffv6uu4mhe8sv7guz5nmm4afysqlmepzl",
    "proposalTxHash": "defbf15b06092718adf4befeab982e03d2966b9caeef93c19e470549ef75ea4900",
    "proposalIndex": 0,
    "voteTxHash": "5b29ba2a4512e1df0c5e44fe6f474e85499ef5e9d881db3255b847420f7dee7c",
    "blockTime": "2025-06-06T08:07:49.000Z",
    "vote": "Yes",
    "metaUrl": null,
    "metaHash": null,
    "proposalTitle": "2025 Cardano Blockchain Ecosystem Budget - 7.5M ₳ for community builders",
    "proposalType": "InfoAction",
    "proposedEpoch": 556,
    "expirationEpoch": 563,
    "rationale": "Members of the Mesh DRep have voted as following on the governace action: 2025 Cardano Blockchain Ecosystem Budget - 7.5M ₳ for community builders: \n\nYes: 6 votes \nNo: 1 votes \nAbstain: 0 votes\n\nTherefore, we support the proposal.\n\nRationale:\n\nWe see the proposal as a serious effort from cardano builders to enable funds for important development which further improves the Cardano ecosystem.\n\nWhile we generally act careful with package proposals like this, which include multiple projects and funding allocations under one proposal, we think that the total of 7 projects within this package have a high likelyhood of a successful execution. Most teams in this proposal have a strong track record and have proven to have all required skills and expertise to ensure a successful implementation.\n\nThat being sad, we still have some doubts on the administrations of the proposal and hope that the effectivity and efficiency wont be impacted by too much bureaucratic overhead which naturally comes with large collaborative proposals. \n\nIf you approve of our reasoning and want to further support us, we welcome you to delegate to our Mesh DRep\nMore about our DRep at: https://gov.meshjs.dev/drep-voting"
  },
  {
    "proposalId": "gov_action1fpqwxp2kxvnntr8hpkh9q9djm78ccdww7qlhg5safugh4stmcwzqql5lauu",
    "proposalTxHash": "4840e305563327358cf70dae5015b2df8f8c35cef03f74521d4f117ac17bc38400",
    "proposalIndex": 0,
    "voteTxHash": "f582dae8ecb62f09fe005405b607e5323b08066685493ce0918777d8b4191c96",
    "blockTime": "2025-06-05T08:00:34.000Z",
    "vote": "No",
    "metaUrl": null,
    "metaHash": null,
    "proposalTitle": "Cardano Treasury DeFi Liquidity Budget",
    "proposalType": "InfoAction",
    "proposedEpoch": 556,
    "expirationEpoch": 563,
    "rationale": "Members of the Mesh DRep Collective have voted as following on the info action Cardano Treasury DeFi Liquidity Budget : \nYes: 0 votes \nNo: 4 votes \nAbstain: 1 vote\n\nTherefore, we will not support the Proposal in its current form.\n\nOur rationale:\nWe are actually not forcefully against the proposal itself but can not support the proposal since it does not provide the correct onchain data, the stored data from the proposer does not matches anymore the data at the time the proposal was initially created, hence why many explorers are not able to display content correctly, leading to quite some confusion for DReps. \n\nWe encourage the proposer to resubmit the proposal with the correct data.\n\nIf you approve of our reasoning and want to further support us, we welcome you to delegate to our Mesh DRep\nMore about our DRep at: https://gov.meshjs.dev/drep-voting"
  },
  {
    "proposalId": "gov_action1vdlrcftd48qn2zz8egepr6xyfcmxpfz8r69k769gc5mhg662adesq9yy8pl",
    "proposalTxHash": "637e3c256da9c1350847ca3211e8c44e3660a4471e8b6f68a8c537746b4aeb7300",
    "proposalIndex": 0,
    "voteTxHash": "6c64b6b54aca658afc154dedb3d5f72f4ca8baa66f01f5d44edc7451c027b970",
    "blockTime": "2025-06-04T14:25:43.000Z",
    "vote": "Yes",
    "metaUrl": null,
    "metaHash": null,
    "proposalTitle": "Set a 300 million ADA Net Change Limit for Epochs 563–635",
    "proposalType": "InfoAction",
    "proposedEpoch": 556,
    "expirationEpoch": 563,
    "rationale": "Members of the Mesh DRep have voted as following on the governace action: Set a 300 million ADA Net Change Limit for Epochs 563–635: \n\nYes: 0 votes \nNo: 2 votes \nAbstain: 3 votes\n\nTherefore, we will vote Abstain on the proposal in its current form.\n\nRationale:\n\nWe already voted Yes on the NCL = 200M Ada proposal and vote abstain on the NCL 300M Ada."
  },
  {
    "proposalId": "gov_action1u9x73kwufaxa70lfy59g4ynwyrcsaxdcd0gxzzmh67s9fxq4j8hqqk2phgh",
    "proposalTxHash": "e14de8d9dc4f4ddf3fe9250a8a926e20f10e99b86bd0610b77d7a054981591ee00",
    "proposalIndex": 0,
    "voteTxHash": "a77ce4a6648f6693ace082ac212e049b463806699beb212fd301730d67da5f35",
    "blockTime": "2025-06-01T13:54:30.000Z",
    "vote": "No",
    "metaUrl": null,
    "metaHash": null,
    "proposalTitle": "Cardano Blockchain Ecosystem Budget - 275M ada Administered by Intersect",
    "proposalType": "InfoAction",
    "proposedEpoch": 557,
    "expirationEpoch": 564,
    "rationale": "Members of the Mesh DRep have voted as following on the governace action: Cardano Blockchain Ecosystem Budget - 275M ada Administered by Intersect: \n\nYes: 3 votes \nNo: 4 votes \nAbstain: 0 votes\n\nTherefore, we will not support the proposal in its current form.\n\nRationale:\n\nbudget request,\nsince we voted Yes on the NCL 200M Ada, this proposal exceeds the budgets we seem as appropriate for Treasury spendings in 2025, keeping in mind that we are already half-way through the year. Furthermore, we do have doubts of the need of a funding administrator as outlined in the proposal, which itself consumes already several million Ada. Furthermore, even if we may support a large part of the proposals within the package, we identify several budget allocation within the package as highly concerning and dont feel confident to give it a lumb yes vote. We would prefer a  more granular approach which allows voters to decide onchain on each proposal and not only on the whole package as one.\n\nfeasible deliverables,\nDue to the massive package, including a wide range of proposals as well as a funding administrator from which we saw in the past that many efforts have not been managed as effectively as we would like to, we see large risks in the successful delivery of the proposal. The produced overhead likely introduces many non-essential burocratic processes which will consume time and resources which could be better spend otherwise and which actually introduces many risks since the process introduces a single point of failure with a central funding administrator on which all proposals have to rely on. The new onchain governance system, in our perspective, was set to exactly avoid such single points of failures. \n\nEcosystem value,\nSummarising all notes already mentioned, we see a high risk in the successful execution of the proposal and therefore have to doubt the value provided to the ecosystem. \n\nTeam,\nMany proposals included in the package have awesome teams with highest skill sets and experience, however, this does not account for all proposals, either does it apply to the funding administrator. Lets be clear, we appreciate Intersect and its effort, yet the past has shown that many efforts at Intersect have not been able to stand up and match with the communities expectations. We surely believe that intersect has its place at the ecosystem, and while Intersect matures and gains experience and expertise, we still think that Intersect at its current stage has a high risk on being a effective administrator of such a large budget and scope. \n\nRecommendation.\nLearn from Project Catalyst, start small, build experience and expertise step by step and increase scope and budgets over time to ensure that the actual capacities to effectively manage such large operations are battle proofed and well matured.\n\nIf you approve of our reasoning and want to further support us, we welcome you to delegate to our Mesh DRep\nMore about our DRep at: https://gov.meshjs.dev/drep-voting"
  },
  {
    "proposalId": "gov_action10k0unljvaej0kd89w7pn0zkgdx59c7xkl0x5q78dzvdtd73u0kmqq5xl5y5",
    "proposalTxHash": "7d9fc9fe4cee64fb34e57783378ac869a85c78d6fbcd4078ed131ab6fa3c7db600",
    "proposalIndex": 0,
    "voteTxHash": "d7b13ea9b79ef883ea74210583d1a0333e32953e988bbbfc182cbfa69d05e1de",
    "blockTime": "2025-05-13T08:09:20.000Z",
    "vote": "Yes",
    "metaUrl": null,
    "metaHash": null,
    "proposalTitle": "2025 Cardano NCL",
    "proposalType": "InfoAction",
    "proposedEpoch": 554,
    "expirationEpoch": 561,
    "rationale": "Members of the Mesh DRep have voted as following on the 2025 Cardano NCL\nYes: 4 votes\nNo: 0 votes\nAbstain: 3 votes\n\nWhen it comes to Cardano Treasury spendings, with Mesh we are surely more on the conservative side.\nWe see the first year of Cardano onchain governance and its treasury spendings as a crucial year in which we'd do better to prioritise on how we spend treasury and making sure that spendings are effective and efficient, focusing on high quality spending rather then high quantity spending. Having a smaller NCL sends a clear message to the ecosystem to be careful and more strict in our budget allocations in 2025.\n\nAlso worth to keep in mind that in 2025, we are in the periodically recurring bull year, from historical data we can expect a increase of Ada price, meaning that less Ada have to be spend. This is already the case since we see many budget proposals currently calculating their budget requests on 0.50 USD per Ada, yet the last time Ada was globally traded at 0.50 USD/Ada was in late 2024.\n\nTherefore, we support the NCL = 200M ADA."
  },
  {
    "proposalId": "gov_action10ueqgzwenxr39le68n0se9peu92r7gm2846xwehh3u0ahc0qd0uqqyljxu5",
    "proposalTxHash": "7f320409d9998712ff3a3cdf0c9439e1543f236a3d746766f78f1fdbe1e06bf800",
    "proposalIndex": 0,
    "voteTxHash": "edb68b980c151d01db1db054af4f176c2af9bdbedfa977aed08e1354fd717120",
    "blockTime": "2025-04-16T07:23:15.000Z",
    "vote": "No",
    "metaUrl": null,
    "metaHash": null,
    "proposalTitle": "Set 2025 Net Change Limit of 300M ADA, 2026 Net Change Limit of 250M ADA",
    "proposalType": "InfoAction",
    "proposedEpoch": 546,
    "expirationEpoch": 553,
    "rationale": "We see the alternative '2025 Net-Change-Limit' (gov_action1nd3t833j7v5sz65k3tp9yyvztw60sjcjgcgjr37682s3m7frwrusqmd2k80) proposal as a more robust and clear proposal, since it focuses on 2025 solely instead of 2025+2026, we vote NO on this proposal and YES on the alternative. We see the NCL of 350M Ada for 2025 as a relatively high, yet acceptable metric which is likely to cover all most relevant funding to core operations within the Cardano Ecosystem"
  },
  {
    "proposalId": "gov_action1nd3t833j7v5sz65k3tp9yyvztw60sjcjgcgjr37682s3m7frwrusqmd2k80",
    "proposalTxHash": "9b62b3c632f329016a968ac25211825bb4f84b12461121c7da3aa11df92370f900",
    "proposalIndex": 0,
    "voteTxHash": "97286d801834e523e53c16ae2fc255f233ba8a1651eb0cf379e5d5f8ae22bd1f",
    "blockTime": "2025-04-14T14:37:06.000Z",
    "vote": "Yes",
    "metaUrl": null,
    "metaHash": null,
    "proposalTitle": "2025 Net Change Limit",
    "proposalType": "InfoAction",
    "proposedEpoch": 547,
    "expirationEpoch": 554,
    "rationale": "We see the NCL of 350M Ada for 2025 as a relatively high, yet acceptable metric which is likely to cover all most relevant funding to core operations within the Cardano Ecosystem. Good enough to agree with. Lets then make sure that we effectively allocate budgets up to 350m ADA in 2025 and not waste funds with projects no one needs. "
  },
  {
    "proposalId": "gov_action12meeq4r43udremwpm6fzt4nt7fctvt0ah7798x036m2r4nhlccmqqhmr9wx",
    "proposalTxHash": "56f39054758f1a3cedc1de9225d66bf270b62dfdbfbc5399f1d6d43aceffc63600",
    "proposalIndex": 0,
    "voteTxHash": "464ceed8ec269a28d3fee305b1c0d397270b8193fbbb2557ab51c1b070f9171f",
    "blockTime": "2025-03-11T12:42:54.000Z",
    "vote": "Yes",
    "metaUrl": null,
    "metaHash": null,
    "proposalTitle": "Defining the Cardano Vision and Roadmap for 2025 and beyond",
    "proposalType": "InfoAction",
    "proposedEpoch": 542,
    "expirationEpoch": 549,
    "rationale": "We see the proposed roadmap  for 2025 as a helpful effort in building ecosystem wide alignment on top priorities, and vote Yes on this proposal. We also hope that this proposal will encourage other efforts which aim to propose further roadmaps for the Cardano ecosystem. Since we achieved the last of the initial Cardano Milestones with Voltaire, we think that longterm roadmaps at Cardano have proven their worth and value and are a existential part of our culture and careful longterm thinking"
  },
  {
    "proposalId": "gov_action1js2s9v92zpxg2rge0y3jt9zy626he2m67x9kx9phw4r942kvsn6sqfym0d7",
    "proposalTxHash": "941502b0aa104c850d197923259444d2b57cab7af18b63143775465aaacc84f500",
    "proposalIndex": 0,
    "voteTxHash": "08b9205dcac01fed95287f6dc82f744cf66792c1de9f65d318c1085d2bca5946",
    "blockTime": "2025-02-22T12:30:39.000Z",
    "vote": "No",
    "metaUrl": null,
    "metaHash": null,
    "proposalTitle": "Decrease Treasury Tax from 20% to 10%",
    "proposalType": "ParameterChange",
    "proposedEpoch": 539,
    "expirationEpoch": 546,
    "rationale": "While we generally agree to reduce treasury spending and think that reducing the allocation to the Treasury is a effective way to achieve lower spending capacities, we yet see that we lack research on how such changes will impact the SPO ecosystem and deem that we currently should not change treasury income before we have better insights"
  },
  {
    "proposalId": "gov_action133jnaewfsq8x6v08ndd87l2yqryp63r30t2dkceacxx5cply5n7sqzlcyqf",
    "proposalTxHash": "8c653ee5c9800e6d31e79b5a7f7d4400c81d44717ad4db633dc18d4c07e4a4fd00",
    "proposalIndex": 0,
    "voteTxHash": "3bed0723c02caca480d000ffa2ca4b4eec82cc8c02d5d8e5d3f9cac6e7bae1f1",
    "blockTime": "2025-02-10T13:30:03.000Z",
    "vote": "Yes",
    "metaUrl": null,
    "metaHash": null,
    "proposalTitle": "Cardano Constitution to Replace the Interim Constitution",
    "proposalType": "NewConstitution",
    "proposedEpoch": 537,
    "expirationEpoch": 544,
    "rationale": "We see the proposed Constitution as a major improvement to the currently active interim Constitution and feel confident that emerging governance infrastructure and capacities are in place and growing to build and act upon the new Constitution. However, while we respect the significant community engagement and involvement which has led to major improvements, we still see room for improvements at the proposed constitution and hope that further evolutions lead of a constantly evolving constitution which is able to reflect and support rapid ecosystem growth and changes"
  }
]